/************************************************************************
* 版权所有 (C)2015, 上海华虹集成电路有限责任公司
* 
* 文件名称：bsp_drvFpga.h
* 文件标识：
* 内容摘要：FPGA 驱动对外接口头文件
* 其它说明：
* 当前版本：
* 作            者：
* 完成日期：
************************************************************************/
#ifndef _BSP_DRV_FPGA_H_
#define _BSP_DRV_FPGA_H_

#ifdef __cplusplus
extern "C"
{
#endif


/**************************************************************************
 *                                                     宏定义                                                          *
**************************************************************************/
#define BSP_DRV_FPGA_WAKEUP_ENABLE          1     /*使能发送唤醒信号*/
#define BSP_DRV_FPGA_WAKEUP_DISABLE         2     /*禁能发送唤醒信号*/
	

#define BSP_DRV_FPGA_BASE_ADDR (0xc0000000)
#define BSP_DRV_FPGA_ADDR_WIDTH (0x01000000)
#define BSP_DRV_FPGA_PORT_WIDTH (0x10)

#define FPGA_SEND_FIFO_WIDTH                   130 

#define    FPGA_IOCTL_BASE            'F'
#define    FPGA_ENABLE_WAKEUP_MODE   _IO(FPGA_IOCTL_BASE, 1)
#define    FPGA_DISABLE_WAKEUP_MODE  _IO(FPGA_IOCTL_BASE, 2)
#define    FPGA_ENABLE_INTERRUPT     _IO(FPGA_IOCTL_BASE, 3)
#define    FPGA_DISABLE_INTERRUPT    _IO(FPGA_IOCTL_BASE, 4)
#define    FPGA_INT_TOG_SET          _IO(FPGA_IOCTL_BASE, 5) 
#define    FPGA_RESET_SIGNAL         _IO(FPGA_IOCTL_BASE, 6) 
#define    FPGA_WRITE_REG            _IO(FPGA_IOCTL_BASE, 7) 
#define    FPGA_READ_REG             _IO(FPGA_IOCTL_BASE, 8)


/**************************************************************************
*                                                  数据类型                                                       *
**************************************************************************/
/*  fpga数据类型定义*/
typedef volatile unsigned short* T_FpgaVirtAddr;
    typedef unsigned short T_FpgaData;



/**************************************************************************
*                                                         模板                                                       *
**************************************************************************/


/**************************************************************************
*                                              全局变量声明                                            *
**************************************************************************/

/*  fpga用户空间虚拟地址*/
extern T_FpgaVirtAddr g_pvBSPDrvFpgaVirtStartAddr0;


/**************************************************************************
* 函数名称：bsp_fpga_init
* 功能描述：fpga 模块初始化函数
* 访问的表：无
* 修改的表：无
* 输入参数：无
* 输出参数：无
* 返 回 值    ：0: 成功；其他为失败
* 其它说明：
* 修改日期    版本号     修改人      修改内容
* -----------------------------------------------
**************************************************************************/
unsigned int bsp_fpga_init(void);

/**************************************************************************
* 函数名称：bsp_fpga_read_reg
* 功能描述：读FPGA寄存器函数
* 访问的表：无
* 修改的表：无
* 输入参数：wRegOffset：FPGA寄存器偏移
* 输出参数：pwRegData：独到寄存器数据的指针
* 返 回 值    ：0: 成功；其他为失败
* 其它说明：
* 修改日期    版本号     修改人      修改内容
* -----------------------------------------------
**************************************************************************/
unsigned int bsp_fpga_read_reg(unsigned int wRegOffset,T_FpgaData *pwRegData);

/**************************************************************************
* 函数名称：bsp_fpga_write_reg
* 功能描述：写FPGA寄存器函数
* 访问的表：无
* 修改的表：无
* 输入参数：
*                                wRegOffset：FPGA寄存器偏移
*                                wRegData：需要写入的数据
* 输出参数：无
* 返 回 值    ：0: 成功；其他为失败
* 其它说明：
* 修改日期    版本号     修改人      修改内容
* -----------------------------------------------
**************************************************************************/
unsigned int bsp_fpga_write_reg(unsigned int wRegOffset,T_FpgaData  wRegData);

/**************************************************************************
* 函数名称：bsp_fpga_write_frame
* 功能描述：写FPGA帧数据函数
* 访问的表：无
* 修改的表：无
* 输入参数：pucDataPacket：要写入的数据包指针
*                               dwDataLen：要写入数据的长度
*                               ucflag：写帧数据标志,唤醒模式或非唤醒模式(8900)
* 输出参数：pdwWriteLen：实际写入数据的长度
* 返 回 值    ：0: 成功；其他为失败
* 其它说明：
* 修改日期    版本号     修改人      修改内容
* -----------------------------------------------
**************************************************************************/
unsigned int bsp_fpga_write_frame(unsigned char*pucDataPacket,unsigned int dwDataLen, unsigned char ucflag, unsigned int *pdwWriteLen);

/**************************************************************************
* 函数名称：bsp_fpga_read_frame
* 功能描述：读FPGA帧数据函数
* 访问的表：无
* 修改的表：无
* 输入参数：pucDataPacket：读出数据存放目的指针
*                                dwDataLen：要读取数据的长度
* 输出参数：pdwReadLen：实际读出数据的长度
* 返 回 值    ：0: 成功；其他为失败
* 其它说明：
* 修改日期    版本号     修改人      修改内容
* -----------------------------------------------
**************************************************************************/
unsigned int bsp_fpga_read_frame(unsigned char*pucDataPacket,unsigned int dwDataLen,unsigned int *pdwReadLen);

/**************************************************************************
* 函数名称：bsp_fpga_reset
* 功能描述：FPGA 复位函数
* 访问的表：无
* 修改的表：无
* 输入参数：无
* 输出参数：无
* 返 回 值    ：0: 成功；其他为失败
* 其它说明：
* 修改日期    版本号     修改人      修改内容
* -----------------------------------------------
**************************************************************************/
unsigned int bsp_fpga_reset(void);

/**************************************************************************
* 函数名称：bsp_fpga_int_enable
* 功能描述：FPGA 中断使能函数
* 访问的表：无
* 修改的表：无
* 输入参数：无
* 输出参数：无
* 返 回 值    ：0: 成功；其他为失败
* 其它说明：
* 修改日期    版本号     修改人      修改内容
* -----------------------------------------------
**************************************************************************/
unsigned int bsp_fpga_int_enable(void);

/**************************************************************************
* 函数名称：bsp_fpga_int_disenable
* 功能描述：FPGA 中断禁能函数
* 访问的表：无
* 修改的表：无
* 输入参数：无
* 输出参数：无
* 返 回 值    ：0: 成功；其他为失败
* 其它说明：
* 修改日期    版本号     修改人      修改内容
* -----------------------------------------------
**************************************************************************/
unsigned int bsp_fpga_int_disable(void);

#ifdef __cplusplus
}
#endif


#endif/* _BSP_DRV_FPGA_H_  */
